

#批量创建文件夹
import os

# themes = ['Python3面向对象编程','Python高级编程2th','Python 核心编程2th','流程的Python','Python参考手册4th']
# themes = ['１．python数据模型','2.序列构成的数组','3.字典和集合','4.文本和字节序列','5.一等函数','6.使用一等函数实现设计模式','7.函数装饰器和闭包','8.对象引用，可变性和垃圾回收','９．符合python风格的对象','10.序列的修改，散列和切片','11.接口：从协议到抽象基类','12.继承的优缺点','13.正确重载运算符','14.可迭代的对象，迭代器和生成器','15.上下文管理器和else块','16.协程','17.使用期物处理并发','18.使用asyncio包处理并发','19.动态属性和特性','20.属性描述符','21.类元编程']
# themes = ['１．面向对象设计','２．Python对象','３．当对象是相似的','４．异常处理','５．何时使用面向对此编程','６．Python数据结构','７．Ｐython里面面向对象的快捷方式','８．设计模式１','９．设计模式２','１０．文件和字符串','１１．测试面向对象的程序','１２．常用Python３库']
# themes = ['１．Pｙthon现状','2.语法最佳实践————类级别以下','３．语法最佳实现————类级别以上','４．选择好的名称','５．编写一个包','６．部署代码','７．使用其他语言开发Python扩展','８．管理代码','９．文档化你的项目','１０．测试驱动开发','１１．优化————一般原则与分析技术','１２．优化————一些强大的技术','１３．并发','１４．有用的设计模式']

# themes = ['1.欢迎来到Python世界','2.快速入门','３．Python基础','４．Python对象','５．数字','６．序列：字符串，列表和元组','７．映像和集合类型','８．条件和循环','９．文件和输入输出','１０．错误和异常','１１．函数和函数式编程','１２．模块','１３．面向对象编程','１４．执行环境','１５．正则表达式','１６．网络编程','１７．网络客户端编程','１８．多线程编程','１９．图形用户界面编程','２０．web编程','２１．数据库编程','２２．扩展Python','23.其他话题']
# themes = ['１．Ｐython简介','2.词法约定和语法','３．类型和对象','４．运算符与表达式','５．程序结构与控制流','６．函数与函数式编程','７．类与面向对象编程','８．模块，包与分发','９．输入与输出','１０．执行环境','１１．测试，调试，探查与调优','１２．内置函数和异常','１３．Python运行时服务','１４．数学运算','１５．数据结构，算法与代码简化','１６．字符串和文本处理','１７．Python数据库访问','１８．文件与目录处理','１９．操作系统服务','２０．线程与并发','２１．网络编程和套接字','２２．网络应用程序编程','２３．web编程','２４．网络数据处理和编码','２５．其他库模块','２６．扩展与嵌入Python','附录python3']
themes = ['1.基础知识','2.列表和元组','３．使用字符串','４．字典：当索引不好用时','５．条件，循环和其他语句','６．抽象','７．更加抽象','８．异常','９．魔法方法，属性和迭代器','１０．充电时刻','１１．文件和素材','１２．图形用户界面','１３．数据库支持','１４．网络编程','１５．Python和万维网','１６．测试','１７．扩展Python','18.程序打包','１９．好玩的编程','２０．项目１：即时标记','２１．项目２：画幅好画','２２．万能的xml','23.项目４：新闻聚合','２４．项目５：虚拟茶话会','２５．项目６：使用CGI进行远程编辑','２６．项目７：自定义电子公告版','２７.项目８：使用xml-rpc进行文件共享','２８．项目９：文件共享2————GUI版本','２９．项目１０：DIY街机游戏','附录a','附录ｂ','附录ｃ','附录ｄ']
base = "/home/karson/Recoding_Python/Python基础教程2th/"
for i in themes:
    file_name = base + str(i)
    os.mkdir(file_name)


# 批量创建py文件(linux命令)
#
# touch file.{1..6}.py
